hello-yan3/STM32-learning/13-WDG—看门狗/WWDG—窗口看门狗/User/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  fire
  * @version V1.0
  * @date    2013-xx-xx
  * @brief   测试led
  ******************************************************************************
  * @attention
  *
  * 实验平台:野火 F103-霸道 STM32 开发板 
  * 论坛    :http://www.firebbs.cn
  * 淘宝    :https://fire-stm32.taobao.com
  *
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx.h"
#include "./usart/bsp_debug_usart.h"
#include "./led/bsp_led.h"  
#include "bsp_wwdg.h"


/**
  * @brief  主函数
  * @param  无
  * @retval 无
  */
int main(void)
{
	// tr 递减计时器的初始值,  wr 上窗口值
	uint8_t wwdg_tr, wwdg_wr;
  
  HAL_Init();
  /* 系统时钟初始化成72MHz */
  SystemClock_Config();
	/* LED 端口初始化 */
	LED_GPIO_Config();	   

	//检查窗口看门狗复位标志位
	if (__HAL_RCC_GET_FLAG(RCC_FLAG_WWDGRST) != RESET)
	{
		// 看门狗复位启动，红色灯亮
		LED_RED;

		//清除复位标志位
		__HAL_RCC_CLEAR_RESET_FLAGS();
	}
	else
	{
		// 正常启动，蓝色灯亮
		LED_BLUE;
	}
	HAL_Delay(1000);
	LED_RGBOFF;  // 关闭所有灯
	HAL_Delay(1000);

	// 看门狗放在要监控程序前初始化
	WWDG_Config();	
	
	// 窗口值我们在初始化的时候设置成0X5F，这个值不会改变
	wwdg_wr = WWDG->CFR & 0X7F;

	while(1)
	{	
		//-----------------------------------------------------
		// 这部分应该写需要被WWDG监控的程序，这段程序运行的时间
		// 决定了窗口值应该设置成多大。
		//-----------------------------------------------------
		// 计时器值，初始化成最大0X7F，当开启WWDG时候，这个值会不断减小
		// 当计数器的值大于窗口值时喂狗的话，会复位，当计数器减少到0X40
		// 还没有喂狗的话就非常非常危险了，计数器再减一次到了0X3F时就复位
		// 所以要当计数器的值在窗口值和0X40之间的时候喂狗，其中0X40是固定的。
		
		/*
		实验原理为：
		计数器从0x7F开始递减，直到递减至0x50，此时喂狗，LED反转，
		计数器值重新变为0x7F，之后继续向下，重复该过程
		实验现象展示为：绿灯持续闪烁
		注释掉此段程序，则不会进行看门狗喂狗
		此时，实验现象展示位：蓝灯闪烁，之后红灯1s间隔持续闪烁
		*/
		wwdg_tr = WWDG->CR & 0X7F;
		if( wwdg_tr == wwdg_wr)
		{
			// 喂狗，重新设置计数器的值为最大0X7F
			HAL_WWDG_Refresh(&WWDG_Handle);
			// 正常喂狗，绿色灯闪烁
			LED2_TOGGLE;
		}
	}
}

/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 72000000
  *            HCLK(Hz)                       = 72000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 2
  *            APB2 Prescaler                 = 1
  *            HSE Frequency(Hz)              = 8000000
  *            HSE PREDIV1                    = 2
  *            PLLMUL                         = 9
  *            Flash Latency(WS)              = 0
  * @param  None
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_ClkInitTypeDef clkinitstruct = {0};
  RCC_OscInitTypeDef oscinitstruct = {0};
  
  /* Enable HSE Oscillator and activate PLL with HSE as source */
  oscinitstruct.OscillatorType  = RCC_OSCILLATORTYPE_HSE;
  oscinitstruct.HSEState        = RCC_HSE_ON;
  oscinitstruct.HSEPredivValue  = RCC_HSE_PREDIV_DIV2;
  oscinitstruct.PLL.PLLState    = RCC_PLL_ON;
  oscinitstruct.PLL.PLLSource   = RCC_PLLSOURCE_HSE;
  oscinitstruct.PLL.PLLMUL      = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&oscinitstruct)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }

  /* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 
     clocks dividers */
  clkinitstruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
  clkinitstruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  clkinitstruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  clkinitstruct.APB2CLKDivider = RCC_HCLK_DIV1;
  clkinitstruct.APB1CLKDivider = RCC_HCLK_DIV2;  
  if (HAL_RCC_ClockConfig(&clkinitstruct, FLASH_LATENCY_0)!= HAL_OK)
  {
    /* Initialization Error */
    while(1); 
  }
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
